// Написать программу Введите имя пользователя
Console.WriteLine("Введите имя");
String username=Console.ReadLine();
Console.WriteLine("Привет, ");
Console.WriteLine("Irina, ");
